import React,{useRef} from 'react'
import './function-setting.scss'

const defaultFuns = {
  copy: {
    icon:'<svg t="1603375965274" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3171" width="48" height="48"><path d="M832.19 128H432.84c-35.43 0-64.14 28.72-64.14 64.14V320h64V192.14v-0.06c0.02-0.03 0.06-0.06 0.09-0.09h399.47c0.03 0.02 0.06 0.06 0.09 0.09v399.48c-0.02 0.03-0.06 0.06-0.09 0.09H703.33v64h128.86c35.43 0 64.14-28.72 64.14-64.14V192.14c0-35.42-28.72-64.14-64.14-64.14z" fill="#FFEB76" p-id="3172"></path><path d="M592.19 368H192.84c-35.43 0-64.14 28.72-64.14 64.14V831.5c0 35.43 28.72 64.14 64.14 64.14h399.35c35.43 0 64.14-28.72 64.14-64.14V432.14c0-35.42-28.72-64.14-64.14-64.14zM512 724H271.99v-64H512v64z m0-120H271.99v-64H512v64z" fill="#FFEB76" p-id="3173"></path><path d="M592.19 432h0.06c0.03 0.02 0.06 0.06 0.09 0.09v399.47c-0.02 0.03-0.06 0.06-0.09 0.09H192.78c-0.03-0.02-0.06-0.06-0.09-0.09V432.14v-0.06c0.02-0.03 0.06-0.06 0.09-0.09h399.41m0-63.99H192.84c-35.43 0-64.14 28.72-64.14 64.14V831.5c0 35.43 28.72 64.14 64.14 64.14h399.35c35.43 0 64.14-28.72 64.14-64.14V432.14c0-35.42-28.72-64.14-64.14-64.14z" fill="#333333" p-id="3174"></path><path d="M512 540H271.99v64H512v-64zM512 660H271.99v64H512v-64zM832.19 128H432.84c-35.43 0-64.14 28.72-64.14 64.14V320h64V192.14v-0.06c0.02-0.03 0.06-0.06 0.09-0.09h399.47c0.03 0.02 0.06 0.06 0.09 0.09v399.48c-0.02 0.03-0.06 0.06-0.09 0.09H703.33v64h128.86c35.43 0 64.14-28.72 64.14-64.14V192.14c0-35.42-28.72-64.14-64.14-64.14z" fill="#333333" p-id="3175"></path></svg>',
    name:'复制',
    shortcut:'',
    clickScript: `(function(){writeTextToClipboard(API.text);
                API.notification('已复制，去粘贴使用吧','success',3000);
            })();`
  },
  baidu:{
    icon:'<svg t="1603457554872" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="19431" width="48" height="48"><path d="M0 0h1024v1024H0z" fill="#FFFFFF" p-id="19432"></path><path d="M412.266496 352.396288c50.030592 0 90.456064-57.403392 90.456064-128.381952 0-70.91712-40.425472-128.304128-90.456064-128.304128-49.969152 0-90.502144 57.387008-90.502144 128.304128 0 70.97856 40.532992 128.381952 90.50112 128.381952M627.729408 360.882176c66.895872 8.64256 109.89568-62.502912 118.443008-116.424704 8.716288-53.829632-34.43712-116.40832-81.770496-127.16032-47.45728-10.841088-106.693632 64.91648-112.086016 114.318336-6.449152 60.38016 8.685568 120.684544 75.413504 129.266688M244.107264 533.393408c90.57792-19.408896 78.262272-127.328256 75.55072-150.936576-4.457472-36.374528-47.36512-99.9168-105.63584-94.908416-73.315328 6.551552-84.022272 112.134144-84.022272 112.134144-9.926656 48.820224 23.728128 153.119744 114.107392 133.710848M892.84096 451.418112c0-25.777152-21.476352-103.4752-101.210112-103.4752-79.885312 0-90.5472 73.315328-90.5472 125.144064 0 49.477632 4.182016 118.532096 103.384064 116.333568 99.233792-2.168832 88.373248-112.057344 88.373248-138.002432M340.296704 721.117184c-2.650112 7.588864-8.578048 26.998784-3.46112 43.902976 10.139648 37.902336 43.16672 39.612416 43.16672 39.612416h47.42656V689.01888H376.61696c-22.82496 6.795264-33.85344 24.49408-36.320256 32.099328" fill="#3388FF" p-id="19433"></path><path d="M701.000704 850.308096H565.492736c-52.496384-13.499392-54.992896-50.683904-54.992896-50.683904V650.2144l54.992896-0.88576v134.291456c3.354624 14.294016 21.200896 16.889856 21.200896 16.889856h55.852032V650.2144h58.45504V850.30912z m-219.33056 0.80896H363.931648c-50.85696-10.093568-71.108608-44.71296-73.68192-50.607104-2.527232-5.986304-16.91136-33.794048-9.283584-81.088512 21.982208-70.90176 84.666368-76.002304 84.666368-76.002304h62.683136v-76.796928l53.354496 0.80896V851.11808z m309.95456-173.247488S688.14848 598.065152 627.73248 511.81568c-81.862656-127.174656-198.191104-75.42272-237.085696-10.750976-38.724608 64.671744-99.095552 105.582592-107.70432 116.409344-8.670208 10.674176-124.952576 73.238528-99.141632 187.55584C209.6128 919.28576 300.26752 917.071872 300.26752 917.071872s66.820096 6.565888 144.362496-10.735616c77.51168-17.133568 144.300032 4.276224 144.300032 4.276224s181.126144 60.471296 230.66624-55.952384c49.52576-116.409344-27.971584-176.790528-27.971584-176.790528z" fill="#3388FF" p-id="19434"></path></svg>',
    name:'百度搜索',
    shortcut:'b',
    clickUrl: 'https://www.baidu.com/s?wd=${keyword}'
  },
  fanyi: {
    icon:'<svg t="1603457616548" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="21051" width="48" height="48"><path d="M955.733333 1024h-400.497777L291.271111 204.8h664.462222c37.701404 0 68.266667 30.565262 68.266667 68.266667v682.666666c0 37.701404-30.565262 68.266667-68.266667 68.266667z" fill="#D9D9D9" p-id="21052"></path><path d="M68.266667 0h400.497777l263.964445 828.302222H68.266667c-37.701404 0-68.266667-30.565262-68.266667-68.266666V68.266667C0 30.565262 30.565262 0 68.266667 0z" fill="#4F8BF5" p-id="21053"></path><path d="M555.235556 1024l177.493333-195.697778h-239.707022z" fill="#4252B8" p-id="21054"></path><path d="M756.954453 614.286222c32.768-39.207822 56.269938-82.120249 70.514916-128.73728h-203.671325l-10.922666-34.998044h93.5936V387.367822h58.481778v63.183076h194.910435v34.998044h-84.923733c-12.875093 53.812338-42.411804 107.597369-88.610134 161.355094 31.794062 33.66912 72.590222 72.480996 122.38848 116.440177-10.613191 11.377778-21.877191 22.345956-33.778346 32.904534-46.430436-43.945529-85.610951-83.244373-117.550649-117.891983-16.707129 17.03936-35.089067 34.074169-55.150365 51.108978 0 2.17088-4.983467-13.853582-14.941297-48.068835a500.258133 500.258133 0 0 0 40.79616-35.871858c-41.565298-48.3328-66.141298-85.77024-73.741654-112.303218h50.50368c6.398862 20.748516 23.765902 47.768462 52.10112 81.064391z" fill="#617D8B" p-id="21055"></path><path d="M1024 682.666667L546.133333 204.8h409.6c37.701404 0 68.266667 30.565262 68.266667 68.266667v409.6z" fill="#FFFFFF" opacity=".192" p-id="21056"></path><path d="M291.271111 445.048604V387.367822h145.439858V440.502044c-2.494009 36.445298-38.902898 130.025244-145.439858 130.025245-119.088924 0-159.002169-97.962667-159.002169-159.762205 0-61.804089 47.490844-152.293831 159.002169-152.293831 37.651342 0 71.356871 13.202773 101.112036 39.60832L347.7504 343.472356c-12.611129-13.726151-31.439076-20.589227-56.479289-20.589227-45.056 0-90.394169 33.901227-90.394169 91.272533 0 97.848889 135.877973 136.06912 171.677014 30.897494H291.271111z" fill="#FFFFFF" p-id="21057"></path></svg>',
    name:'谷歌翻译',
    shortcut:'t',
    clickUrl: 'https://translate.google.cn/#view=home&op=translate&sl=auto&tl=auto&text=${keyword}'
  },
    record: {
        icon:'<svg t="1603689943505" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1288" width="32" height="32"><path d="M424.64 623.936l-153.6-164.544a57.728 57.728 0 0 1 0-77.568 48.768 48.768 0 0 1 72.384 0L460.8 507.584l219.84-235.456a48.768 48.768 0 0 1 72.384 0 57.728 57.728 0 0 1 0 77.568l-256 274.304A49.728 49.728 0 0 1 460.8 640a49.28 49.28 0 0 1-36.16-16.064z" fill="#4D94FF" p-id="1289"></path><path d="M896 128v712.32l-48.896-32.576a127.744 127.744 0 0 0-161.472 16l-45.632 45.632-38.272-38.272a127.552 127.552 0 0 0-90.496-37.504c-32 0-64.064 11.968-88.896 35.968l-41.28 39.808-41.792-43.456a128 128 0 0 0-163.2-17.664L128 840.32V128h768m64-128H64C28.736 0 0 28.672 0 64v895.936c0 23.616 12.992 45.248 33.792 56.512a64.576 64.576 0 0 0 65.792-3.264l147.52-98.368 86.336 89.6c11.84 12.096 28.032 19.264 44.992 19.52l2.24 0.064a61.44 61.44 0 0 0 43.392-18.048L511.232 921.6l83.52 83.52a63.808 63.808 0 0 0 90.496 0l90.88-90.88 148.352 98.88A64 64 0 0 0 1024 959.872V64a64 64 0 0 0-64-64z" fill="#4D94FF" p-id="1290"></path></svg>',
        name:'创建一个标记',
        shortcut:'',
        clickScript: `(function(){API.record({bg:"#e2e202"}); })();`
    },
    mailto:{
      icon:'<svg t="1603711839289" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3195" width="32" height="32"><path d="M960.9 405.7l-448 323.4-448-323.4 448-323.4z" fill="#5B79FB" p-id="3196"></path><path d="M187.3 139.1h651.2v795.4H187.3z" fill="#E5ECFF" p-id="3197"></path><path d="M335 222h355.7v73.9H335z" fill="#FF7E71" p-id="3198"></path><path d="M258.3 358h509.3v37H258.3zM258.3 420.7h509.3v37H258.3zM258.3 483.4h509.3v37H258.3zM258.3 546.1h509.3v37H258.3z" fill="#FFFFFF" p-id="3199"></path><path d="M64.9 934.5h896V405.7l-448 323.4-448-323.4z" fill="#5B79FB" p-id="3200"></path><path d="M64.9 934.5h896L594.6 670.1H431.2z" fill="#83A4FF" p-id="3201"></path></svg>',
      name:'发送信息到邮箱',
      clickScript: `(function () {
          var targetInfo = API.targetInfo || {};
          console.log(targetInfo);
          var subject = encodeURIComponent("[PAGENOTE摘录]"+targetInfo.text);
          var body = encodeURIComponent(targetInfo.pre+targetInfo.text+targetInfo.suffix+"----------来自"+API.href);
          var mailTo = "mailto:xxx@gmail.com?cc=logikecn@gmail.com&bcc=&subject="+subject+"&body="+body;
          var a = document.createElement('a');
          a.href=mailTo;
          a.click();
      })()`
    }
};

export default function FunctionIconSetting({funItem={name:'',shortcut:'',clickScript:'',clickUrl:'',icon:''},groupIndex,itemIndex,onSave}) {
  const nameInput = useRef(null);
  const iconInput = useRef(null);
  const shortcutInput = useRef(null);
  const urlInput = useRef(null);
  const scriptInput = useRef(null);


  const save = function () {
    const fun = {
      name: nameInput.current.value || '',
      shortcut: shortcutInput.current.value || '',
      clickScript: scriptInput.current.value || '',
      clickUrl: urlInput.current.value || '',
      icon: iconInput.current.value || '',
    };
    onSave(fun,groupIndex,itemIndex)
  };


  const setTheme = function (e) {
    const type = e.target.value;
     const values = defaultFuns[type];
     if(!values){
       return;
     }
     nameInput.current.value = values.name || '';
     shortcutInput.current.value = values.shortcut || '';
     scriptInput.current.value = values.clickScript || '';
     urlInput.current.value = values.clickUrl || '';
     iconInput.current.value = values.icon || '';
  };

  const show = groupIndex>-1 && itemIndex>-1;
  return(
    <div className='function-setting-form'>
      <h4>
        按钮设置
        {
          show &&
          <div>
            使用预设：
            <select name="" id="" onChange={setTheme}>
              <option value="-"></option>
                {
                    Object.keys(defaultFuns).map((key)=>(
                        <option key={key} value={key}>{defaultFuns[key].name}</option>
                    ))
                }
            </select>
          </div>
        }
      </h4>
      <div>
        {show?'':'选择一个功能按钮进行设置'}
      </div>

      {
        show &&
        <div>
          <div>
            <div className="label">按钮名称：</div><input placeholder='取一个名字吧，不要重复' ref={nameInput} type="text" defaultValue={funItem.name}/>
          </div>
          <div>
            <div className="label">按钮图标：</div><input placeholder='svg图片或者网络https链接图片' ref={iconInput} type="text" defaultValue={funItem.icon}/>
          </div>
          <div>
            <div className="label">快捷键：</div><input placeholder='一个字母或数字' maxLength={1} ref={shortcutInput} type="text" defaultValue={funItem.shortcut} />
          </div>
          <div>
            <div className="label">跳转链接：</div><input placeholder='链接里用${keyword}表示替换值' ref={urlInput} type="text" defaultValue={funItem.clickUrl} />
          </div>
          <div>
            <div className="label">执行函数：</div><textarea placeholder='确保安全的一段执行脚本：(function(){})();' ref={scriptInput} type="text" defaultValue={funItem.clickScript}/>
          </div>
          <div>
            <button onClick={save}>
              { funItem.name?'修改':'新建' }
            </button>
          </div>
        </div>
      }
    </div>
  )
}
